var aaronland = aaronland || {};
aaronland.jpana = aaronland.jpana || {};

aaronland.jpana.tables = (function(){

    var self = {
	
	hirigana: function(){

	    return {
		// oneH
		
		"a": "あ",
		"i": "い",
		"u": "う",
		"e": "え",
		"o": "お",
		
		/*
		"xa": "ぁ",
		"xi": "ぃ",
		"xu": "ぅ",
		"xe": "ぇ",
		"xo": "ぉ",
		"la": "ぁ",
		"li": "ぃ",
		"lu": "ぅ",
		"le": "ぇ",
		"lo": "ぉ",
		 */
		
		"ka": "か",
		"ki": "き",
		"ku": "く",
		"ke": "け",
		"ko": "こ",
		
		"ga": "が",
		"gi": "ぎ",
		"gu": "ぐ",
		"ge": "げ",
		"go": "ご",
		
		"sa": "さ",
		"shi": "し",				
		// "si": "し",
		"su": "す",
		"se": "せ",
		"so": "そ",
		
		"za": "ざ",
		"x-zi": "",
		// "zi": "じ",
		"zu": "ず",
		"ze": "ぜ",
		"zo": "ぞ",
		
		"ja": "じゃ",
		"ji": "じ",		
		"ju": "じゅ",
		"x-je": "",
		"jo": "じょ",
		
		"ta": "た",
		"ti": "ち",
		"tsu": "つ",		
		// "tu": "つ",
		"te": "て",		
		"to": "と",	
		
		"da": "だ",
		"di": "ぢ",
		"du": "づ",		
		"de": "で",
		"do": "ど",
		
		"na": "な",
		"ni": "に",
		"nu": "ぬ",
		"ne": "ね",
		"no": "の",
		
		"ha": "は",
		"hi": "ひ",
		"fu": "ふ",
		// "hu": "ふ",
		"he": "へ",
		"ho": "ほ",
		
		"ba": "ば",
		"bi": "び",
		"bu": "ぶ",
		"be": "べ",
		"bo": "ぼ",
		
		"pa": "ぱ",
		"pi": "ぴ",
		"pu": "ぷ",
		"pe": "ぺ",
		"po": "ぽ",
		
		"fa": "ふぁ",
		"fi": "ふぃ",
		"x-fu": "",
		"fe": "ふぇ",
		"fo": "ふぉ",
		
		"ma": "ま",
		"mi": "み",
		"mu": "む",
		"me": "め",
		"mo": "も",
		
		"ya": "や",
		"x-yi": "",
		"yu": "ゆ",
		"ye": "いぇ",
		"yo": "よ",
		
		"ra": "ら",
		"ri": "り",
		"ru": "る",
		"re": "れ",
		"ro": "ろ",
		
		"wa": "わ",
		//"wa": "うぁ",
		"wi": "うぃ",		
		//"wi": "ゐ",
		"": "",
		"we": "うぇ",		
		//"we": "ゑ",
		"wo": "を",		
		//"wo": "うぉ",
		
		"va": "ゔぁ",
		"vi": "ゔぃ",
		"vu": "ゔ",
		"ve": "ゔぇ",
		"vo": "ゔぉ",
		
		// threeH
		
		"kya": "きゃ",
		"x-kyi": "",
		"kyu": "きゅ",
		"x-kye": "",
		"kyo": "きょ",
		
		"gya": "ぎゃ",
		"x-gyi": "",
		"gyu": "ぎゅ",
		"x-gye": "",		
		"gyo": "ぎょ",
		
		
		"sha": "しゃ",
		"x-shi": "",
		"shu": "しゅ",
		"x-she": "",
		"sho": "しょ",
		
		"sya": "しゃ",
		"x-syi": "",
		"syu": "しゅ",
		"x-sye": "",
		"syo": "しょ",

		"cha": "ちゃ",		
		"chi": "ち",
		"chu": "ちゅ",		
		"che": "ちぇ",
		"cho": "ちょ",
				
		"tya": "ちゃ",
		"x-tyi": "",
		"tyu": "ちゅ",
		"tye": "ちぇ",
		"tyo": "ちょ",
		
		"dha": "ぢゃ",
		"dhi": "でぃ",
		"dhu": "でゅ",		
		//"dhu": "ぢゅ",
		"dhe": "ぢぇ",
		"dho": "ぢょ",

		// TBD...
		// "dwu": "どぅ",
		
		"nya": "にゃ",
		"x-nyi": "",
		"nyu": "にゅ",
		"x-nye": "",
		"nyo": "にょ",
		
		"hya": "ひゃ",
		"x-hyi": "",
		"hyu": "ひゅ",
		"x-hye": "",
		"hyo": "ひょ",
		
		"bya": "びゃ",
		"x-byi": "",		
		"byu": "びゅ",
		"x-bye": "",		
		"byo": "びょ",
		
		"pya": "ぴゃ",
		"x-pyi": "",		
		"pyu": "ぴゅ",
		"x-pye": "",		
		"pyo": "ぴょ",
		
		"mya": "みゃ",
		"x-myi": "",		
		"myu": "みゅ",
		"x-mye": "",		
		"myo": "みょ",
		
		"xya": "ゃ",
		"x-xyi": "",		
		"xyu": "ゅ",
		"x-xye": "",		
		"xyo": "ょ",
		
		"lya": "ゃ",
		"x-lyi": "",		
		"lyu": "ゅ",
		"x-lye": "",		
		"lyo": "ょ",
		
		"rya": "りゃ",
		"x-ryi": "",		
		"ryu": "りゅ",
		"x-rye": "",		
		"ryo": "りょ",

		"n": "ん",		
	    };
	},
    };

    return self;
    
})();
